function get_totem(year)
{
    etalon=1976
    ost=0
    totems=[
        "Темный Сох (Лось)",
        "Жалящий Шершень (Оса)",
        "Притаившийся Лют (Волк)",
        "Огненная Векша (Белка)",
        "Жемчужная Щука",
        "Бородатая Жаба",
        "Дикий Вепрь (Кабан) ",
        "Белый Филин",
        "Шипящий Уж ",
        "Крадущийся Лис",
        "Свернувшийся Еж",
        "Парящий Орел",
        "Прядущий Мизгирь (Паук) ",
        "Кричащий Петух",
        "Златорогий Тур (Бык)",
        "Огнегривый Конь"
    ]

    ost = Math.abs((year-etalon)%16)
    return totems[ost]
}

//alert(get_totem(2002))